; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v3 ?v10)
             (pred_8 ?v11 ?v2)
             (pred_7 ?v3 ?v2)
             (pred_12 ?v8 ?v3 )
	     (pred_3 ?v3)
             (pred_6 ?v9)
             (pred_10 ?v11)
             (pred_2 ?v2)
             (pred_5 ?v3)
             (pred_11 ?v11)
             (pred_1 ?v3)
             (pred_4 ))



(:action op_2
:parameters (?v5 ?v4 ?v13 ?v1)
:precondition (and (pred_6 ?v5) (pred_6 ?v4) (pred_10 ?v13) (pred_2 ?v1)
          (pred_9 ?v5 ?v4) (pred_8 ?v13 ?v1)
                   (pred_7 ?v4 ?v1) (pred_3 ?v5) 
                   (pred_5 ?v4) (pred_11 ?v13))
:effect (and  (pred_1 ?v4) (not (pred_5 ?v4))))


(:action op_5
:parameters (?v5 ?v7)
:precondition (and (pred_6 ?v5) (pred_6 ?v7)
               (pred_3 ?v5) (pred_9 ?v5 ?v7) (pred_1 ?v7))
:effect (and (pred_3 ?v7) (not (pred_3 ?v5))))

(:action op_1
:parameters (?v5 ?v13)
:precondition (and (pred_6 ?v5) (pred_10 ?v13) 
                  (pred_3 ?v5) (pred_12 ?v13 ?v5) (pred_4 ))
:effect (and (pred_11 ?v13)
   (not (pred_12 ?v13 ?v5)) (not (pred_4 ))))


(:action op_4
:parameters (?v5 ?v12 ?v6)
:precondition (and (pred_6 ?v5) (pred_10 ?v12) (pred_10 ?v6)
                  (pred_3 ?v5) (pred_11 ?v6) (pred_12 ?v12 ?v5))
:effect (and (pred_11 ?v12) (pred_12 ?v6 ?v5)
        (not (pred_11 ?v6)) (not (pred_12 ?v12 ?v5))))

(:action op_3
:parameters (?v5 ?v13)
:precondition (and (pred_6 ?v5) (pred_10 ?v13) 
                  (pred_3 ?v5) (pred_11 ?v13))
:effect (and (pred_4 ) (pred_12 ?v13 ?v5) (not (pred_11 ?v13)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_04 obj_32 obj_29 obj_13 obj_02 obj_20 obj_28 obj_10 obj_19 obj_18 obj_06 obj_14 obj_08 obj_09 obj_21 obj_26 obj_17 obj_31 obj_24 obj_12 obj_16 obj_07 obj_03 obj_30 obj_27
    obj_01 obj_23 obj_05
    obj_25 obj_15 obj_22 obj_11
    )

    (:init
       (pred_4)

       (pred_6 obj_04)
       (pred_6 obj_32)
       (pred_6 obj_29)
       (pred_6 obj_13)
       (pred_6 obj_02)
       (pred_6 obj_20)
       (pred_6 obj_28)
       (pred_6 obj_10)
       (pred_6 obj_19)
       (pred_6 obj_18)
       (pred_6 obj_06)
       (pred_6 obj_14)
       (pred_6 obj_08)
       (pred_6 obj_09)
       (pred_6 obj_21)
       (pred_6 obj_26)
       (pred_6 obj_17)
       (pred_6 obj_31)
       (pred_6 obj_24)
       (pred_6 obj_12)
       (pred_6 obj_16)
       (pred_6 obj_07)
       (pred_6 obj_03)
       (pred_6 obj_30)
       (pred_6 obj_27)
       (pred_2 obj_01)
       (pred_2 obj_23)
       (pred_2 obj_05)
       (pred_10 obj_25)
       (pred_10 obj_15)
       (pred_10 obj_22)
       (pred_10 obj_11)

       (pred_9 obj_04 obj_20)
       (pred_9 obj_04 obj_32)
       (pred_9 obj_32 obj_28)
       (pred_9 obj_32 obj_29)
       (pred_9 obj_32 obj_04)
       (pred_9 obj_29 obj_10)
       (pred_9 obj_29 obj_13)
       (pred_9 obj_29 obj_32)
       (pred_9 obj_13 obj_19)
       (pred_9 obj_13 obj_02)
       (pred_9 obj_13 obj_29)
       (pred_9 obj_02 obj_18)
       (pred_9 obj_02 obj_13)
       (pred_9 obj_20 obj_06)
       (pred_9 obj_20 obj_28)
       (pred_9 obj_20 obj_04)
       (pred_9 obj_28 obj_14)
       (pred_9 obj_28 obj_10)
       (pred_9 obj_28 obj_32)
       (pred_9 obj_28 obj_20)
       (pred_9 obj_10 obj_08)
       (pred_9 obj_10 obj_19)
       (pred_9 obj_10 obj_29)
       (pred_9 obj_10 obj_28)
       (pred_9 obj_19 obj_09)
       (pred_9 obj_19 obj_18)
       (pred_9 obj_19 obj_13)
       (pred_9 obj_19 obj_10)
       (pred_9 obj_18 obj_21)
       (pred_9 obj_18 obj_02)
       (pred_9 obj_18 obj_19)
       (pred_9 obj_06 obj_26)
       (pred_9 obj_06 obj_14)
       (pred_9 obj_06 obj_20)
       (pred_9 obj_14 obj_17)
       (pred_9 obj_14 obj_08)
       (pred_9 obj_14 obj_28)
       (pred_9 obj_14 obj_06)
       (pred_9 obj_08 obj_31)
       (pred_9 obj_08 obj_09)
       (pred_9 obj_08 obj_10)
       (pred_9 obj_08 obj_14)
       (pred_9 obj_09 obj_24)
       (pred_9 obj_09 obj_21)
       (pred_9 obj_09 obj_19)
       (pred_9 obj_09 obj_08)
       (pred_9 obj_21 obj_12)
       (pred_9 obj_21 obj_18)
       (pred_9 obj_21 obj_09)
       (pred_9 obj_26 obj_16)
       (pred_9 obj_26 obj_17)
       (pred_9 obj_26 obj_06)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_31)
       (pred_9 obj_17 obj_14)
       (pred_9 obj_17 obj_26)
       (pred_9 obj_31 obj_03)
       (pred_9 obj_31 obj_24)
       (pred_9 obj_31 obj_08)
       (pred_9 obj_31 obj_17)
       (pred_9 obj_24 obj_30)
       (pred_9 obj_24 obj_12)
       (pred_9 obj_24 obj_09)
       (pred_9 obj_24 obj_31)
       (pred_9 obj_12 obj_27)
       (pred_9 obj_12 obj_21)
       (pred_9 obj_12 obj_24)
       (pred_9 obj_16 obj_07)
       (pred_9 obj_16 obj_26)
       (pred_9 obj_07 obj_03)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_07 obj_16)
       (pred_9 obj_03 obj_30)
       (pred_9 obj_03 obj_31)
       (pred_9 obj_03 obj_07)
       (pred_9 obj_30 obj_27)
       (pred_9 obj_30 obj_24)
       (pred_9 obj_30 obj_03)
       (pred_9 obj_27 obj_12)
       (pred_9 obj_27 obj_30)
       (pred_5 obj_32)
       (pred_5 obj_14)
       (pred_5 obj_30)
       (pred_5 obj_26)
       (pred_7  obj_32 obj_01)
       (pred_7  obj_14 obj_23)
       (pred_7  obj_30 obj_05)
       (pred_7  obj_26 obj_05)
       (pred_1 obj_04)
       (pred_1 obj_29)
       (pred_1 obj_13)
       (pred_1 obj_02)
       (pred_1 obj_20)
       (pred_1 obj_28)
       (pred_1 obj_10)
       (pred_1 obj_19)
       (pred_1 obj_18)
       (pred_1 obj_06)
       (pred_1 obj_08)
       (pred_1 obj_09)
       (pred_1 obj_21)
       (pred_1 obj_17)
       (pred_1 obj_31)
       (pred_1 obj_24)
       (pred_1 obj_12)
       (pred_1 obj_16)
       (pred_1 obj_07)
       (pred_1 obj_03)
       (pred_1 obj_27)

       (pred_8  obj_25 obj_01)
       (pred_8  obj_15 obj_23)
       (pred_8  obj_22 obj_05)
       (pred_8  obj_11 obj_23)
       (pred_12 obj_25 obj_21)
       (pred_12 obj_15 obj_27)
       (pred_12 obj_22 obj_27)
       (pred_12 obj_11 obj_17)
       (pred_3 obj_27)
    )

    (:goal (and
       (pred_12 obj_25 obj_12)
       (pred_12 obj_22 obj_04)
    ))
(:constraints
  (always (not (pred_3 obj_19)))
)
)

; plan
1. (op_1 obj_27 obj_22)
   deleted: (pred_12 obj_22 obj_27) (pred_4)
   added: (pred_11 obj_22)
   goals met: 0 of 2
2. (op_5 obj_27 obj_12)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_12)
   goals met: 0 of 2
3. (op_5 obj_12 obj_21)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_21)
   goals met: 0 of 2
4. (op_4 obj_21 obj_25 obj_22)
   deleted: (pred_11 obj_22) (pred_12 obj_25 obj_21)
   added: (pred_11 obj_25) (pred_12 obj_22 obj_21)
   goals met: 0 of 2
5. (op_5 obj_21 obj_12)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_12)
   goals met: 0 of 2
6. (op_3 obj_12 obj_25)
   deleted: (pred_11 obj_25)
   added: (pred_4) (pred_12 obj_25 obj_12)
   goals met: 1 of 2
7. (op_5 obj_12 obj_21)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_21)
   goals met: 1 of 2
8. (op_1 obj_21 obj_22)
   deleted: (pred_12 obj_22 obj_21) (pred_4)
   added: (pred_11 obj_22)
   goals met: 1 of 2
9. (op_5 obj_21 obj_09)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_09)
   goals met: 1 of 2
10. (op_5 obj_09 obj_08)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_08)
   goals met: 1 of 2
11. (op_5 obj_08 obj_10)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_10)
   goals met: 1 of 2
12. (op_5 obj_10 obj_28)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_28)
   goals met: 1 of 2
13. (op_5 obj_28 obj_20)
   deleted: (pred_3 obj_28)
   added: (pred_3 obj_20)
   goals met: 1 of 2
14. (op_5 obj_20 obj_04)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_04)
   goals met: 1 of 2
15. (op_3 obj_04 obj_22)
   deleted: (pred_11 obj_22)
   added: (pred_4) (pred_12 obj_22 obj_04)
   goals met: 2 of 2
